docs/todo.org
#+TITLE: todo list
#+DATE: <2019-01-24 Thu>
#+AUTHOR: Jacob Motley
* TODO preserve last selected project between sessions
** TODO what do we do with it once the app loads?
* DONE after saving project, navigate to plant collect menu
* DONE suggest default name for trip
* DONE after saving trip, navigate to site page
* DONE check all fields in CSV
** DONE check occurrence notes
** DONE check gps coordinate, extra information
* TODO load exported csv into qt desktop
 - double check that all fields are being exported correctly
* TODO give the app a name
I like the idea of having a 1-2 syllable name for an application.
Keeps it simple and easy to remember.
 - pacquisition --- plant acquisition?
 - herbacq --- herbaria acquisition? // this is probably the wrong use
   of the word, but maybe its catchy?
 - plantacq --- plant acquisition?
 - specacq --- specimen acquisition?
 - collspec -- collect specimen?
 - plantcoll - plant collecting?
 - specnotes - specimen notes?
 - collnotes - collecting notes?
** app pair naming idea
 - Give both the desktop and mobile apps a prefix like
   spec* or coll*. Distinguish with a suffix like *notes
   for mobile and *book for the desktop.
 - This will hopefully help the user understand that the
   two are complementary.
 - example:
   - mobile - specnotes
   - desktop - specbook
 - another example:
   - mobile - collnotes
   - desktop - collbook
